# -*- coding: utf-8 -*-
"""Homework1_3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/14ByZRR21nrDTK-8ThDazvau4jL_3ZJGH
"""

# Задача 1.3.

# Напишите скрипт, который принимает от пользователя номер месяца, 
# а возвращает количество дней в нем.
# Результат проверки вывести на консоль
# Допущение: в феврале 28 дней
# Если номер месяца некорректен - сообщить об этом

# Например,
    # Введите номер месяца: 3
    # Вы ввели март. 31 дней

    # Введите номер месяца: 2
    # Вы ввели февраль. 28 дней

    # Введите номер месяца: 15
    # Такого месяца нет!

query = input('Введите номер месяца: ')
if query in ('1', '3', '5', '7', '8', '10', '12'):
    days31 = '31 день' # для длинных месяцев
    if query == '1':
        print('Вы ввели январь. ', days31)
    elif query == '3':
        print('Вы ввели март. ', days31)
    elif query == '5':
        print('Вы ввели май. ', days31)
    elif query == '7':
        print('Вы ввели июль. ', days31)
    elif query == '8':
        print('Вы ввели август. ', days31)
    elif query == '10':
        print('Вы ввели октябрь. ', days31)
    elif query == '12':
        print('Вы ввели декабрь. ', days31)
elif query in ('4', '6', '9', '11'):
    days30 = '30 дней' # для месяцев покороче
    if query == '2':
        print('Вы ввели февраль. 28 дней')    
    elif query == '4':
        print('Вы ввели апрель. ', days30)    
    elif query == '6':
        print('Вы ввели июнь. ', days30)     
    elif query == '9':
        print('Вы ввели сентябрь. ', days30)    
    elif query == '11':
        print('Вы ввели ноябрь. ', days30)    
else:
    print('Такого месяца нет!')